Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/**
 ******************************************************************************
 * @file    ST1633i_reg.h
 * @author  MCD Application Team
 * @brief   Header of ST1633i_reg.c
 *          
 ******************************************************************************
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef ST1633I_REG_H
#define ST1633I_REG_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
/* Macros --------------------------------------------------------------------*/

/** @addtogroup BSP
 * @{
 */

/** @addtogroup Component
 * @{
 */

/** @addtogroup ST1633I
 * @{
 */

/* Exported types ------------------------------------------------------------*/

/** @defgroup ST1633I_Exported_Types ST1633I Exported Types
 * @{
 */
/************** Generic Function  *******************/

typedef int32_t (*ST1633I_Write_Func)(void *, uint8_t, uint8_t*, uint16_t);
typedef int32_t (*ST1633I_Read_Func) (void *, uint8_t, uint8_t*, uint16_t);

/**
 * @}
 */

/** @defgroup ST1633I_Imported_Globals ST1633I Imported Globals
 * @{
 */
typedef struct
{
  ST1633I_Write_Func   WriteReg;
  ST1633I_Read_Func    ReadReg;
  void                *handle;
} ST1633I_ctx_t;
/**
 * @}
 */

/** @defgroup ST1633I_Exported_Constants ST1633I Exported Constants
 * @{
 */

//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################


/* Device Control register of the ST1633I (R/W) */
#define ST1633I_DEV_CONTROL_REG         0x02

/* Advanced Touch Information Register */
#define ST1633I_ADVANCED_TOUCH_INFO_REG          0x10

#define ST1633I_SENSING_COUNTER_H_REG          0x07
#define ST1633I_SENSING_COUNTER_L_REG          0x08

#define XY0_Coordinate_H_REG         0x12
#define X0_Coordinate_L_REG          0x13
#define Y0_Coordinate_L_REG          0x14

#define XY1_Coordinate_H_REG         0x16
#define X1_Coordinate_L_REG          0x17
#define Y1_Coordinate_L_REG          0x18

#define XY2_Coordinate_H_REG         0x1A
#define X2_Coordinate_L_REG          0x1B
#define Y2_Coordinate_L_REG          0x1C

#define XY3_Coordinate_H_REG         0x1E
#define X3_Coordinate_L_REG          0x1F
#define Y3_Coordinate_L_REG          0x20

#define XY4_Coordinate_H_REG         0x22
#define X4_Coordinate_L_REG          0x23
#define Y4_Coordinate_L_REG          0x24

#define XY5_Coordinate_H_REG         0x26
#define X5_Coordinate_L_REG          0x27
#define Y5_Coordinate_L_REG          0x28

#define XY6_Coordinate_H_REG         0x2A
#define X6_Coordinate_L_REG          0x2B
#define Y6_Coordinate_L_REG          0x2C

#define XY7_Coordinate_H_REG         0x2E
#define X7_Coordinate_L_REG          0x2F
#define Y7_Coordinate_L_REG          0x30

#define XY8_Coordinate_H_REG         0x32
#define X8_Coordinate_L_REG          0x33
#define Y8_Coordinate_L_REG          0x34

#define XY9_Coordinate_H_REG         0x36
#define X9_Coordinate_L_REG          0x37
#define Y9_Coordinate_L_REG          0x38


/*******************************************************************************
* Register      : Device Control Register
* Address       : 0X02
* Bit Group Name:
* Permission    : R/W
*******************************************************************************/
typedef struct {
  uint8_t reset              	: 1;
  uint8_t power_down            : 1;
  uint8_t deep_power_down       : 1;
  uint8_t not_used_1            : 1;
  uint8_t not_used_2            : 1;
  uint8_t proximity_enable      : 1;
  uint8_t multi_touch_disable   : 1;
  uint8_t not_used_3            : 1;
} st1633i_device_control_t;

/*******************************************************************************
* Register      : Advanced Touch Info
* Address       : 0X10
* Bit Group Name:
* Permission    : R
*******************************************************************************/
typedef struct {
  uint8_t gesture_type              : 4;
  uint8_t not_used_1                : 1;
  uint8_t water_flag                : 1;
  uint8_t proximity_flag            : 1;
  uint8_t not_used_2                : 1;
} st1633i_advanced_touch_info_t;

/*******************************************************************************
* Register      : XY Coordinates
* Address       :
* Bit Group Name:
* Permission    : R
*******************************************************************************/
typedef struct {
  uint8_t y              	: 3;
  uint8_t not_used_1        : 1;
  uint8_t x                	: 3;
  uint8_t valid            	: 1;
} st1633i_xy_coordinates_t;


int32_t  ST1633I_dev_control_w(ST1633I_ctx_t *ctx, st1633i_device_control_t value);
int32_t  ST1633I_dev_control_r(ST1633I_ctx_t *ctx, st1633i_device_control_t *value);
int32_t	 ST1633I_touch_status(ST1633I_ctx_t *ctx, uint8_t *value, uint16_t *x, uint16_t *y);
int32_t  ST1633I_sensing_counter(ST1633I_ctx_t *ctx, uint16_t *value);
int32_t  ST1633I_xy(ST1633I_ctx_t *ctx, uint8_t reg_addr, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy0(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy1(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy2(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy3(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy4(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy5(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy6(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy7(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy8(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t  ST1633I_xy9(ST1633I_ctx_t *ctx, uint8_t *valid, uint16_t *x, uint16_t *y);
int32_t	 ST1633I_xy_all(ST1633I_ctx_t *ctx, uint8_t *valid_arr, uint16_t *x_arr, uint16_t *y_arr);
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################
//#############################################################################################################




