Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/* P1 X, Y coordinates, weight and misc registers */
#define ST1633I_P1_XH_REG            0x03U
#define ST1633I_P1_XL_REG            0x04U
#define ST1633I_P1_YH_REG            0x05U
#define ST1633I_P1_YL_REG            0x06U
#define ST1633I_P1_WEIGHT_REG        0x07U
#define ST1633I_P1_MISC_REG          0x08U

/* P2 X, Y coordinates, weight and misc registers */
#define ST1633I_P2_XH_REG            0x09U
#define ST1633I_P2_XL_REG            0x0AU
#define ST1633I_P2_YH_REG            0x0BU
#define ST1633I_P2_YL_REG            0x0CU
#define ST1633I_P2_WEIGHT_REG        0x0DU
#define ST1633I_P2_MISC_REG          0x0EU

/* P3 X, Y coordinates, weight and misc registers */
#define ST1633I_P3_XH_REG            0x0FU
#define ST1633I_P3_XL_REG            0x10U
#define ST1633I_P3_YH_REG            0x11U
#define ST1633I_P3_YL_REG            0x12U
#define ST1633I_P3_WEIGHT_REG        0x13U
#define ST1633I_P3_MISC_REG          0x14U

/* P4 X, Y coordinates, weight and misc registers */
#define ST1633I_P4_XH_REG            0x15U
#define ST1633I_P4_XL_REG            0x16U
#define ST1633I_P4_YH_REG            0x17U
#define ST1633I_P4_YL_REG            0x18U
#define ST1633I_P4_WEIGHT_REG        0x19U
#define ST1633I_P4_MISC_REG          0x1AU

/* P5 X, Y coordinates, weight and misc registers */
#define ST1633I_P5_XH_REG            0x1BU
#define ST1633I_P5_XL_REG            0x1CU
#define ST1633I_P5_YH_REG            0x1DU
#define ST1633I_P5_YL_REG            0x1EU
#define ST1633I_P5_WEIGHT_REG        0x1FU
#define ST1633I_P5_MISC_REG          0x20U

/* P6 X, Y coordinates, weight and misc registers */
#define ST1633I_P6_XH_REG            0x21U
#define ST1633I_P6_XL_REG            0x22U
#define ST1633I_P6_YH_REG            0x23U
#define ST1633I_P6_YL_REG            0x24U
#define ST1633I_P6_WEIGHT_REG        0x25U
#define ST1633I_P6_MISC_REG          0x26U

/* P7 X, Y coordinates, weight and misc registers */
#define ST1633I_P7_XH_REG            0x27U
#define ST1633I_P7_XL_REG            0x28U
#define ST1633I_P7_YH_REG            0x29U
#define ST1633I_P7_YL_REG            0x2AU
#define ST1633I_P7_WEIGHT_REG        0x2BU
#define ST1633I_P7_MISC_REG          0x2CU

/* P8 X, Y coordinates, weight and misc registers */
#define ST1633I_P8_XH_REG            0x2DU
#define ST1633I_P8_XL_REG            0x2EU
#define ST1633I_P8_YH_REG            0x2FU
#define ST1633I_P8_YL_REG            0x30U
#define ST1633I_P8_WEIGHT_REG        0x31U
#define ST1633I_P8_MISC_REG          0x32U

/* P9 X, Y coordinates, weight and misc registers */
#define ST1633I_P9_XH_REG            0x33U
#define ST1633I_P9_XL_REG            0x34U
#define ST1633I_P9_YH_REG            0x35U
#define ST1633I_P9_YL_REG            0x36U
#define ST1633I_P9_WEIGHT_REG        0x37U
#define ST1633I_P9_MISC_REG          0x38U

/* P10 X, Y coordinates, weight and misc registers */
#define ST1633I_P10_XH_REG           0x39U
#define ST1633I_P10_XL_REG           0x3AU
#define ST1633I_P10_YH_REG           0x3BU
#define ST1633I_P10_YL_REG           0x3CU
#define ST1633I_P10_WEIGHT_REG       0x3DU
#define ST1633I_P10_MISC_REG         0x3EU

/* Threshold for touch detection */
#define ST1633I_TH_GROUP_REG         0x80

/* Filter function coefficients */
#define ST1633I_TH_DIFF_REG          0x85

/* Control register */
#define ST1633I_CTRL_REG             0x86

/* The time period of switching from Active mode to Monitor mode when there is no touching */
#define ST1633I_TIMEENTERMONITOR_REG 0x87

/* Report rate in Active mode */
#define ST1633I_PERIODACTIVE_REG     0x88

/* Report rate in Monitor mode */
#define ST1633I_PERIODMONITOR_REG    0x89

/* The value of the minimum allowed angle while Rotating gesture mode */
#define ST1633I_RADIAN_VALUE_REG     0x91

/* Maximum offset while Moving Left and Moving Right gesture */
#define ST1633I_OFFSET_LR_REG        0x92

/* Maximum offset while Moving Up and Moving Down gesture */
#define ST1633I_OFFSET_UD_REG        0x93

/* Minimum distance while Moving Left and Moving Right gesture */
#define ST1633I_DISTANCE_LR_REG      0x94

/* Minimum distance while Moving Up and Moving Down gesture */
#define ST1633I_DISTANCE_UD_REG      0x95

/* Maximum distance while Zoom In and Zoom Out gesture */
#define ST1633I_DISTANCE_ZOOM_REG    0x96

/* High 8-bit of LIB Version info */
#define ST1633I_LIB_VER_H_REG        0xA1

/* Low 8-bit of LIB Version info */
#define ST1633I_LIB_VER_L_REG        0xA2

/* Chip Selecting */
#define ST1633I_CIPHER_REG           0xA3

/* Interrupt mode register (used when in interrupt mode) */
#define ST1633I_GMODE_REG            0xA4

/* Current power mode the ST1633I system is in (R) */
#define ST1633I_PWR_MODE_REG         0xA5

/* ST1633I firmware version */
#define ST1633I_FIRMID_REG           0xA6

/* ST1633I Chip identification register */
#define ST1633I_CHIP_ID_REG          0xA8

/* Release code version */
#define ST1633I_RELEASE_CODE_ID_REG  0xAF

/* Current operating mode the ST1633I system is in (R) */
#define ST1633I_STATE_REG            0xBC

/**
 * @}
 */

/*******************************************************************************
* Register      : Generic - All
* Address       : Generic - All
* Bit Group Name: None
* Permission    : W
*******************************************************************************/
int32_t ST1633I_write_reg(ST1633I_ctx_t *ctx, uint8_t reg, uint8_t *pbuf, uint16_t length);
int32_t ST1633I_read_reg(ST1633I_ctx_t *ctx, uint8_t reg, uint8_t *pbuf, uint16_t length);

/**************** Base Function  *******************/



/*******************************************************************************
* Register      : GEST_DEVICE_STATUS
* Address       : 0X01
* Bit Group Name: Status Error
* Permission    : R
*******************************************************************************/
#define   ST1633I_DEVICE_STATUS_BIT_MASK        0xFFU
#define   ST1633I_DEVICE_STATUS_BIT_POSITION    0
int32_t ST1633I_device_status(ST1633I_ctx_t *ctx, uint8_t *value);
/*******************************************************************************
* Register      : P1_XH
* Address       : 0X03
* Bit Group Name: First Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P1_XH_EF_BIT_MASK        0xC0U
#define   ST1633I_P1_XH_EF_BIT_POSITION    6
int32_t ST1633I_p1_xh_ef(ST1633I_ctx_t *ctx, uint8_t *value);

