Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/*******************************************************************************
* Register      : P1_XH
* Address       : 0X03
* Bit Group Name: First Touch X Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P1_XH_TP_BIT_MASK        0x0FU
#define   ST1633I_P1_XH_TP_BIT_POSITION    0
int32_t ST1633I_p1_xh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P1_XL
* Address       : 0X04
* Bit Group Name: First Touch X Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P1_XL_TP_BIT_MASK        0xFFU
#define   ST1633I_P1_XL_TP_BIT_POSITION    0
int32_t ST1633I_p1_xl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P1_YH
* Address       : 0X05
* Bit Group Name: First Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P1_YH_TID_BIT_MASK        0xF0U
#define   ST1633I_P1_YH_TID_BIT_POSITION    4
int32_t ST1633I_p1_yh_tid(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P1_YH
* Address       : 0x06
* Bit Group Name: First Touch Y Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P1_YH_TP_BIT_MASK        0x0FU
#define   ST1633I_P1_YH_TP_BIT_POSITION    0
int32_t ST1633I_p1_yh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P1_YL
* Address       : 0X06
* Bit Group Name: First Touch Y Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P1_YL_TP_BIT_MASK        0xFFU
#define   ST1633I_P1_YL_TP_BIT_POSITION    0
int32_t ST1633I_p1_yl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P1_WEIGHT
* Address       : 0X07
* Bit Group Name: First Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P1_WEIGHT_BIT_MASK        0xFFU
#define   ST1633I_P1_WEIGHT_BIT_POSITION    0
int32_t ST1633I_p1_weight(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P1_MISC
* Address       : 0X08
* Bit Group Name: First Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P1_MISC_BIT_MASK        0xF0U
#define   ST1633I_P1_MISC_BIT_POSITION    4
int32_t ST1633I_p1_misc(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_XH
* Address       : 0X09
* Bit Group Name: Second Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P2_XH_EF_BIT_MASK        0xC0U
#define   ST1633I_P2_XH_EF_BIT_POSITION    6
int32_t ST1633I_p2_xh_ef(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_XH
* Address       : 0X09
* Bit Group Name: Second Touch X Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P2_XH_TP_BIT_MASK        0x0FU
#define   ST1633I_P2_XH_TP_BIT_POSITION    0
int32_t ST1633I_p2_xh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_XL
* Address       : 0X0A
* Bit Group Name: Second Touch X Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P2_XL_TP_BIT_MASK        0xFFU
#define   ST1633I_P2_XL_TP_BIT_POSITION    0
int32_t ST1633I_p2_xl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_YH
* Address       : 0X0B
* Bit Group Name: Second Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P2_YH_TID_BIT_MASK        0xF0U
#define   ST1633I_P2_YH_TID_BIT_POSITION    4
int32_t ST1633I_p2_yh_tid(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_YH
* Address       : 0x0B
* Bit Group Name: Second Touch Y Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P2_YH_TP_BIT_MASK        0x0FU
#define   ST1633I_P2_YH_TP_BIT_POSITION    0
int32_t ST1633I_p2_yh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_YL
* Address       : 0X0C
* Bit Group Name: Second Touch Y Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P2_YL_TP_BIT_MASK        0xFFU
#define   ST1633I_P2_YL_TP_BIT_POSITION    0
int32_t ST1633I_p2_yl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P2_WEIGHT
* Address       : 0X0D
* Bit Group Name: Second Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P2_WEIGHT_BIT_MASK        0xFFU
#define   ST1633I_P2_WEIGHT_BIT_POSITION    0
int32_t ST1633I_p2_weight(ST1633I_ctx_t *ctx, uint8_t *value);

