Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/*******************************************************************************
* Register      : P2_MISC
* Address       : 0X0E
* Bit Group Name: Second Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P2_MISC_BIT_MASK        0xF0U
#define   ST1633I_P2_MISC_BIT_POSITION    4
int32_t ST1633I_p2_misc(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_XH
* Address       : 0X0F
* Bit Group Name: Third Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P3_XH_EF_BIT_MASK        0xC0U
#define   ST1633I_P3_XH_EF_BIT_POSITION    6
int32_t ST1633I_p3_xh_ef(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_XH
* Address       : 0X0F
* Bit Group Name: Third Touch X High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P3_XH_TP_BIT_MASK        0x0FU
#define   ST1633I_P3_XH_TP_BIT_POSITION    0
int32_t ST1633I_p3_xh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_XL
* Address       : 0X10
* Bit Group Name: Third Touch X Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P3_XL_TP_BIT_MASK        0xFFU
#define   ST1633I_P3_XL_TP_BIT_POSITION    0
int32_t ST1633I_p3_xl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_YH
* Address       : 0X11
* Bit Group Name: Third Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P3_YH_TID_BIT_MASK        0xF0U
#define   ST1633I_P3_YH_TID_BIT_POSITION    4
int32_t ST1633I_p3_yh_tid(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_YH
* Address       : 0x11
* Bit Group Name: Third Touch Y High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P3_YH_TP_BIT_MASK        0x0FU
#define   ST1633I_P3_YH_TP_BIT_POSITION    0
int32_t ST1633I_p3_yh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_YL
* Address       : 0X12
* Bit Group Name: Third Touch Y Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P3_YL_TP_BIT_MASK        0xFFU
#define   ST1633I_P3_YL_TP_BIT_POSITION    0
int32_t ST1633I_p3_yl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_WEIGHT
* Address       : 0X13
* Bit Group Name: Third Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P3_WEIGHT_BIT_MASK        0xFFU
#define   ST1633I_P3_WEIGHT_BIT_POSITION    0
int32_t ST1633I_p3_weight(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_MISC
* Address       : 0X14
* Bit Group Name: Third Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P3_MISC_BIT_MASK        0xF0U
#define   ST1633I_P3_MISC_BIT_POSITION    4
int32_t ST1633I_p3_misc(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_XH
* Address       : 0X15
* Bit Group Name: Fourth Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P4_XH_EF_BIT_MASK        0xC0U
#define   ST1633I_P4_XH_EF_BIT_POSITION    6
int32_t ST1633I_p4_xh_ef(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_XH
* Address       : 0X15
* Bit Group Name: Fourth Touch X High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P4_XH_TP_BIT_MASK        0x0FU
#define   ST1633I_P4_XH_TP_BIT_POSITION    0
int32_t ST1633I_p4_xh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_XL
* Address       : 0X16
* Bit Group Name: Fourth Touch X Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P4_XL_TP_BIT_MASK        0xFFU
#define   ST1633I_P4_XL_TP_BIT_POSITION    0
int32_t ST1633I_p4_xl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_YH
* Address       : 0X17
* Bit Group Name: Fourth Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P4_YH_TID_BIT_MASK        0xF0U
#define   ST1633I_P4_YH_TID_BIT_POSITION    4
int32_t ST1633I_p4_yh_tid(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_YH
* Address       : 0x17
* Bit Group Name: Fourth Touch Y High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P4_YH_TP_BIT_MASK        0x0FU
#define   ST1633I_P4_YH_TP_BIT_POSITION    0
int32_t ST1633I_p4_yh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

