Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/*******************************************************************************
* Register      : P4_YL
* Address       : 0X18
* Bit Group Name: Fourth Touch Y Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P4_YL_TP_BIT_MASK        0xFFU
#define   ST1633I_P4_YL_TP_BIT_POSITION    0
int32_t ST1633I_p4_yl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_WEIGHT
* Address       : 0X19
* Bit Group Name: Fourth Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P4_WEIGHT_BIT_MASK        0xFFU
#define   ST1633I_P4_WEIGHT_BIT_POSITION    0
int32_t ST1633I_p4_weight(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_MISC
* Address       : 0X1A
* Bit Group Name: Fourth Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P4_MISC_BIT_MASK        0xF0U
#define   ST1633I_P4_MISC_BIT_POSITION    4
int32_t ST1633I_p4_misc(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_XH
* Address       : 0X1B
* Bit Group Name: Fifth Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P5_XH_EF_BIT_MASK        0xC0U
#define   ST1633I_P5_XH_EF_BIT_POSITION    6
int32_t ST1633I_p5_xh_ef(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_XH
* Address       : 0X1B
* Bit Group Name: Fifth Touch X High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P5_XH_TP_BIT_MASK        0x0FU
#define   ST1633I_P5_XH_TP_BIT_POSITION    0
int32_t ST1633I_p5_xh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_XL
* Address       : 0X1C
* Bit Group Name: Fifth Touch X Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P5_XL_TP_BIT_MASK        0xFFU
#define   ST1633I_P5_XL_TP_BIT_POSITION    0
int32_t ST1633I_p5_xl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_YH
* Address       : 0X1D
* Bit Group Name: Fifth Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   ST1633I_P5_YH_TID_BIT_MASK        0xF0U
#define   ST1633I_P5_YH_TID_BIT_POSITION    4
int32_t ST1633I_p5_yh_tid(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_YH
* Address       : 0x1D
* Bit Group Name: Fifth Touch Y High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   ST1633I_P5_YH_TP_BIT_MASK        0x0FU
#define   ST1633I_P5_YH_TP_BIT_POSITION    0
int32_t ST1633I_p5_yh_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_YL
* Address       : 0X1E
* Bit Group Name: Fifth Touch Y Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P5_YL_TP_BIT_MASK        0xFFU
#define   ST1633I_P5_YL_TP_BIT_POSITION    0
int32_t ST1633I_p5_yl_tp(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_WEIGHT
* Address       : 0X1F
* Bit Group Name: Fifth Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P5_WEIGHT_BIT_MASK        0xFFU
#define   ST1633I_P5_WEIGHT_BIT_POSITION    0
int32_t ST1633I_p5_weight(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_MISC
* Address       : 0X20
* Bit Group Name: Fifth Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   ST1633I_P5_MISC_BIT_MASK        0xF0U
#define   ST1633I_P5_MISC_BIT_POSITION    4
int32_t ST1633I_p5_misc(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : TH_GROUP
* Address       : 0X80
* Bit Group Name: Threshold for touch detection
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   ST1633I_TH_GROUP_BIT_MASK        0xFFU
#define   ST1633I_TH_GROUP_BIT_POSITION    0
int32_t ST1633I_th_group(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : TH_DIFF
* Address       : 0X85
* Bit Group Name: Filter function coefficient
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   ST1633I_TH_DIFF_BIT_MASK        0xFFU
#define   ST1633I_TH_DIFF_BIT_POSITION    0
int32_t ST1633I_th_diff(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : CTRL
* Address       : 0X86
* Bit Group Name: 
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   ST1633I_CTRL_BIT_MASK           0xFFU
#define   ST1633I_CTRL_BIT_POSITION       0
int32_t ST1633I_ctrl(ST1633I_ctx_t *ctx, uint8_t value);

