Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/*******************************************************************************
* Register      : TIMEENTERMONITOR
* Address       : 0X87
* Bit Group Name: 
* Permission    : RW
* Default value : 0x0A
*******************************************************************************/
#define   ST1633I_TIMEENTERMONITOR_BIT_MASK           0xFFU
#define   ST1633I_TIMEENTERMONITOR_BIT_POSITION       0
int32_t ST1633I_time_enter_monitor(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : PERIODACTIVE
* Address       : 0X88
* Bit Group Name: 
* Permission    : RW
* Default value : None
*******************************************************************************/
#define   ST1633I_PERIODACTIVE_BIT_MASK           0xFFU
#define   ST1633I_PERIODACTIVE_BIT_POSITION       0
int32_t ST1633I_period_active(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : PERIODMONITOR
* Address       : 0X89
* Bit Group Name: 
* Permission    : RW
* Default value : 0x28
*******************************************************************************/
#define   ST1633I_PERIODMONITOR_BIT_MASK           0xFFU
#define   ST1633I_PERIODMONITOR_BIT_POSITION       0
int32_t ST1633I_period_monitor(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : RADIAN_VALUE
* Address       : 0X91
* Bit Group Name: 
* Permission    : RW
* Default value : 0x0A
*******************************************************************************/
#define   ST1633I_RADIAN_VALUE_BIT_MASK           0xFFU
#define   ST1633I_RADIAN_VALUE_BIT_POSITION       0
int32_t ST1633I_radian_value(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : OFFSET_LEFT_RIGHT
* Address       : 0X92
* Bit Group Name: 
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   ST1633I_OFFSET_LR_BIT_MASK           0xFFU
#define   ST1633I_OFFSET_LR_BIT_POSITION       0
int32_t ST1633I_offset_left_right(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : OFFSET_UP_DOWN
* Address       : 0X93
* Bit Group Name: 
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   ST1633I_OFFSET_UD_BIT_MASK           0xFFU
#define   ST1633I_OFFSET_UD_BIT_POSITION       0
int32_t ST1633I_offset_up_down(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : DISTANCE_LEFT_RIGHT
* Address       : 0X94
* Bit Group Name: 
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   ST1633I_DISTANCE_LR_BIT_MASK           0xFFU
#define   ST1633I_DISTANCE_LR_BIT_POSITION       0
int32_t  ST1633I_disatnce_left_right(ST1633I_ctx_t *ctx, uint8_t value);
        
/*******************************************************************************
* Register      : DISTANCE_UP_DOWN
* Address       : 0X95
* Bit Group Name: 
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   ST1633I_DISTANCE_UD_BIT_MASK           0xFFU
#define   ST1633I_DISTANCE_UD_BIT_POSITION       0
int32_t ST1633I_distance_up_down(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : DISTANCE_ZOOM
* Address       : 0X96
* Bit Group Name: 
* Permission    : RW
* Default value : 0x32
*******************************************************************************/
#define   ST1633I_DISTANCE_ZOOM_BIT_MASK           0xFFU
#define   ST1633I_DISTANCE_ZOOM_BIT_POSITION       0
int32_t ST1633I_distance_zoom(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : LIB_VER_H
* Address       : 0XA1
* Bit Group Name: 
* Permission    : R
* Default value : None
*******************************************************************************/
#define   ST1633I_LIB_VER_H_BIT_MASK           0xFFU
#define   ST1633I_LIB_VER_H_BIT_POSITION       0
int32_t ST1633I_lib_ver_high(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : LIB_VER_L
* Address       : 0XA2
* Bit Group Name: 
* Permission    : R
* Default value : None
*******************************************************************************/
#define   ST1633I_LIB_VER_L_BIT_MASK           0xFFU
#define   ST1633I_LIB_VER_L_BIT_POSITION       0
int32_t ST1633I_lib_ver_low(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : CIPHER
* Address       : 0XA3
* Bit Group Name: 
* Permission    : R
* Default value : 0x06
*******************************************************************************/
#define   ST1633I_CIPHER_BIT_MASK           0xFFU
#define   ST1633I_CIPHER_BIT_POSITION       0
int32_t ST1633I_cipher(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : G_MODE
* Address       : 0XA4
* Bit Group Name: 
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   ST1633I_G_MODE_BIT_MASK           0xFFU
#define   ST1633I_G_MODE_BIT_POSITION       0
int32_t ST1633I_g_mode(ST1633I_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : PWR_MODE
* Address       : 0XA5
* Bit Group Name: 
* Permission    : RW
* Default value : 0x00
*******************************************************************************/
#define   ST1633I_PWR_MODE_BIT_MASK           0xFFU
#define   ST1633I_PWR_MODE_BIT_POSITION       0
int32_t ST1633I_pwr_mode(ST1633I_ctx_t *ctx, uint8_t value);

