Houzich/Car-Scanner-TouchGFX-STM32H7/TouchScreen/ST1633i/ST1633i_reg.h
/*******************************************************************************
* Register      : FIRMID
* Address       : 0XA6
* Bit Group Name: 
* Permission    : R
* Default value : None
*******************************************************************************/
#define   ST1633I_FIRMID_BIT_MASK           0xFFU
#define   ST1633I_FIRMID_BIT_POSITION       0
int32_t ST1633I_firm_id(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : FOCALTECH_ID
* Address       : 0XA8
* Bit Group Name: 
* Permission    : R
* Default value : 0x11
*******************************************************************************/
#define   ST1633I_CHIP_ID_BIT_MASK           0xFFU
#define   ST1633I_CHIP_ID_BIT_POSITION       0
int32_t ST1633I_chip_id(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : RELEASE_CODE_ID
* Address       : 0XAF
* Bit Group Name: 
* Permission    : R
* Default value : 0x001
*******************************************************************************/
#define   ST1633I_RC_ID_BIT_MASK           0xFFU
#define   ST1633I_RC_ID_BIT_POSITION       0
int32_t ST1633I_release_code_id(ST1633I_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : STATE
* Address       : 0XBC
* Bit Group Name: 
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   ST1633I_STATE_BIT_MASK           0xFFU
#define   ST1633I_STATE_BIT_POSITION       0
int32_t ST1633I_state(ST1633I_ctx_t *ctx, uint8_t value);

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif
#endif /* ST1633I_REG_H */


/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/


